ЕРПУХАстенд.cbr_Основной/src/Documents/ЗаказНаПроизводство2_2/ЗаказНаПроизводство2_2.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="04b45cc8-19da-4fc2-ab25-fcf16e66f5ee">
  <name>ЗаказНаПроизводство2_2</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ГосЗаказ</name>
    <comment>// Османов Н.М. 27.11.2023 ЧТЗ №2 Управление производством</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпециальныеТребования</name>
    <comment>// Османов Н.М. 27.11.2023 ЧТЗ №2 Управление производством</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="15fca05d-7959-4a2b-9062-e424f3982539">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6df6fc76-a3cd-4de0-a023-25f5c09faf10">
    <name>НачатьНеРанее</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="91b5bd8a-a202-4ee3-a07e-d2244bd4d2bb">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e09e8b15-f8e1-48f5-a895-0a0068c7711a">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="25c088f7-7f66-4e72-9549-39343550e4b5">
    <name>Приоритет</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ff56eabe-a6d5-4725-a7e1-6d3c1cffefbc">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="191fc3ee-3065-4648-ad89-72b3cbf6a108">
    <name>ДатаПотребности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="88a5e505-c602-47c9-9dd8-4b109bf0874f">
    <name>ДинамическаяСтруктура</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bb924568-6ab5-4bc3-9ed4-53888e5a2470">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="0190487c-4b35-4793-bebb-cdc5d67bf079">
    <name>Продукция</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="a32405d7-b213-4b91-8842-bc3b27c23a17">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="dd131bed-f4cf-4ccb-8427-639b59bd5bf2">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="7a6e457f-9de3-483b-9f11-8235c0db3365">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="ce2f7918-6eb6-44a1-9703-eaa30ed728d8">
      <name>Спецификация</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="8fb6ec89-8b54-4467-a7ee-20b1f54a8233">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

ЕРПУХАстенд.cbr_Основной/src/InformationRegisters/СостоянияЗаказовНаПроизводство/СостоянияЗаказовНаПроизводство.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="af3fe76d-a706-4782-ba4f-9c8aef976f10">
  <name>СостоянияЗаказовНаПроизводство</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="eb79bc70-00f9-410b-9910-8d3ae89545ac">
    <name>СостояниеЭтапов</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="8e34fd9d-0edf-4358-82c6-20f15dba8fb9">
    <name>СостояниеОбеспечения</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="a5933e0d-3c87-4070-98d0-f15c6d7a169e">
    <name>СостояниеВыпуска</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="1d6ca309-56d3-4126-b09a-c83072b8e568">
    <name>ДатаСобытия</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="6845edb4-9bb4-4023-a09e-af2481c056e9">
    <name>Заказ</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

ЕРПУХАстенд.cbr_Основной/src/Enums/СтатусыЗаказовНаПроизводство2_2/СтатусыЗаказовНаПроизводство2_2.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="555d6846-e773-489b-bd3c-89b1f2072899">
  <name>СтатусыЗаказовНаПроизводство2_2</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="f552acdf-34c7-46f3-8d72-fc207a70ea04">
    <name>Формируется</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>АктуализацияСпецификаций</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеСпецтребований</name>
  </enumValues>
  <enumValues>
    <name>Разработка</name>
  </enumValues>
  <enumValues extendedConfigurationObject="c3e0c47c-9d7b-4349-82a5-35dfcec47e59">
    <name>КПроизводству</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаСклад</name>
  </enumValues>
  <enumValues extendedConfigurationObject="7cac9ffb-82fe-4e2c-8db3-94162621dc09">
    <name>Закрыт</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

ЕРПУХАстенд.cbr_Основной/src/Enums/СостоянияЗаказовНаПроизводствоВОчереди/СостоянияЗаказовНаПроизводствоВОчереди.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="1c5c577b-e3a7-4f3c-b1dc-4a4635df0092">
  <name>СостоянияЗаказовНаПроизводствоВОчереди</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="0b5da229-df3d-4452-876e-c0cfcee4bb9e">
    <name>ТребуетсяПроверитьЭтапы</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="c8572cef-56b6-41c2-8372-e048b920f71a">
    <name>ТребуетсяСформироватьЭтапы</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="008dd1c4-8df1-47b2-acd9-c62f263da6f8">
    <name>ТребуетсяПередатьЭтапыКВыполнению</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="e2b1148f-633e-43e3-a5e9-44f89acc88d4">
    <name>ТребуетсяОбеспечение</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="46ba682a-7bc1-4fbd-9a16-21fb67734707">
    <name>НарушенаДатаПотребности</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="d50d385f-005b-4c7c-bce0-97899b283e65">
    <name>Выполнен</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

ЕРПУХАстенд.cbr_Основной/src/Documents/ЗаказНаПроизводство2_2/Forms/Очередь/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура П3_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	// НАЧАЛО Османов Н.М. 27.11.2023 ЧТЗ №2 Управление производством
	ПодготовитьФорму();
	// КОНЕЦ Османов Н.М. 27.11.2023 ЧТЗ №2 Управление производством
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПодготовитьФорму()
	
	// НАЧАЛО Османов Н.М. 27.11.2023 ЧТЗ №2 Управление производством
	Если ФормыУХ.ЭлементыФормыУХУжеСозданы(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
												
	ЭлементНомерЗаказа = ФормыУХ.СоздатьПолеФормы(Элементы,
												"СписокКоличество",
												"Количество",
												"Список.Количество",
												,
												Элементы.Список,
												Элементы.Ответственный);
												
	ЭлементНомерЗаказа = ФормыУХ.СоздатьПолеФормы(Элементы,
												"СписокУпаковка",
												"Упаковка",
												"Список.Упаковка",
												,
												Элементы.Список,
												Элементы.Ответственный);

	ЭлементНомерЗаказа = ФормыУХ.СоздатьПолеФормы(Элементы,
												"СписокНомерЗаказа",
												"Номер Заказа",
												"Список.НомерЗаказа",
												,
												Элементы.Список,
												Элементы.Ответственный);
												
	ЭлементГосЗаказ = ФормыУХ.СоздатьПолеФормы(Элементы,
												"СписокГосЗаказ",
												"Госзаказ",
												"Список.ГосЗаказ",
												ВидПоляФормы.ПолеФлажка,
												Элементы.Список,
												Элементы.Ответственный);
												
	ЭлементСпециальныеТребования = ФормыУХ.СоздатьПолеФормы(Элементы,
												"СписокСпециальныеТребования",
												"Спец.требование",
												"Список.СпециальныеТребования",
												,
												Элементы.Список,
												Элементы.Ответственный);
												
	ЭлементДатаЗавершения = ФормыУХ.СоздатьПолеФормы(Элементы,
												"СписокДатаЗавершения",
												"Дата РС",
												"Список.ДатаЗавершения",
												,
												Элементы.Список,
												Элементы.Ответственный);
												
	ЭлементКонтрагент = ФормыУХ.СоздатьПолеФормы(Элементы,
												"СписокКонтрагент",
												"Контрагент",
												"Список.Контрагент",
												,
												Элементы.Список,
												Элементы.Ответственный);
												
	ЭлементНоменклатура = ФормыУХ.СоздатьПолеФормы(Элементы,
												"СписокНоменклатура",
												"Номенклатура",
												"Список.Номенклатура",
												,
												Элементы.Список,
												Элементы.Ответственный);
												
	ПараметрыЭлемента = Новый Структура("АвтоОтметкаНезаполненного", Ложь);
	ЭлементХарактеристика = ФормыУХ.СоздатьПолеФормы(Элементы,
												"СписокХарактеристика",
												"Характеристика",
												"Список.Характеристика",
												,
												Элементы.Список,
												Элементы.Ответственный, 
												ПараметрыЭлемента);												
												
	ГруппаОтбораПоСтатусам = ФормыУХ.СоздатьГруппуФормы(Элементы, 
												"ГруппаОтбораПоСтатусам",
												"Или отобрать по статусам",
												ВидГруппыФормы.ОбычнаяГруппа,
												Элементы.ГруппаЗаказыДопПанель,
												Элементы.Декорация7);
												

	СписокВыбораСтатусов = Новый СписокЗначений;
	
	СписокВыбораСтатусов.Добавить(Перечисления.СтатусыЗаказовНаПроизводство2_2.Формируется, "Формируется");
	СписокВыбораСтатусов.Добавить(Перечисления.СтатусыЗаказовНаПроизводство2_2.АктуализацияСпецификаций, "Актуализация спецификаций");
	СписокВыбораСтатусов.Добавить(Перечисления.СтатусыЗаказовНаПроизводство2_2.СогласованиеСпецтребований, "Согласование спецтребований");
	СписокВыбораСтатусов.Добавить(Перечисления.СтатусыЗаказовНаПроизводство2_2.Разработка, "Разработка");
	СписокВыбораСтатусов.Добавить(Перечисления.СтатусыЗаказовНаПроизводство2_2.КПроизводству, "К производству");
	СписокВыбораСтатусов.Добавить(Перечисления.СтатусыЗаказовНаПроизводство2_2.ВРаботе, "В работе");
	СписокВыбораСтатусов.Добавить(Перечисления.СтатусыЗаказовНаПроизводство2_2.ПередачаНаСклад, "Передача на склад");
	СписокВыбораСтатусов.Добавить(Перечисления.СтатусыЗаказовНаПроизводство2_2.Закрыт, "Закрыт");

	ДобавляемыеРеквизиты = Новый Массив;
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ОтборСпискаВыбораСтатусов", Новый ОписаниеТипов("СписокЗначений")));
	
	Для Каждого СписокЗначение Из СписокВыбораСтатусов Цикл
		СтрокаИмя = СтрЗаменить(СписокЗначение.Значение, " ", "");
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ОтборПоСтатусам" + СтрокаИмя, Новый ОписаниеТипов("Булево")));
	КонецЦикла;
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	ЭтотОбъект["ОтборСпискаВыбораСтатусов"] = СписокВыбораСтатусов;
	
	Для Каждого СписокЗначение Из СписокВыбораСтатусов Цикл
		
		СтрокаИмя = СтрЗаменить(СписокЗначение.Значение, " ", "");
		
		ПараметрыГруппы = Новый Структура("ОтображатьЗаголовок, Отображение, Группровка", Ложь, ОтображениеОбычнойГруппы.Нет, ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда);
		ПодГруппаОтбораПоСтатусам = ФормыУХ.СоздатьГруппуФормы(Элементы, 
												"ГруппаОтбораПоСтатусам" + СтрокаИмя,
												"",
												ВидГруппыФормы.ОбычнаяГруппа,
												Элементы.ГруппаОтбораПоСтатусам,
												, 
												ПараметрыГруппы);

		СобытияПометки = Новый Структура("ПриИзменении", "ПриИзмененииОтбораСтатуса");
		ПолеПометка = ФормыУХ.СоздатьПолеФормы(Элементы,
												"ОтборПоСтатусам" + СтрокаИмя,
												СписокЗначение.Представление,
												"ОтборПоСтатусам" + СтрокаИмя,
												ВидПоляФормы.ПолеФлажка,
												ПодГруппаОтбораПоСтатусам,
												,
												,
												СобытияПометки);
												
										

	КонецЦикла;
	
	ФормыУХ.ЭлементыФормыУХДобавлены(ЭтотОбъект);
	// КОНЕЦ Османов Н.М. 27.11.2023 ЧТЗ №2 Управление производством

КонецПроцедуры

&НаСервере
Функция ТекстЗапросаДинамическогоСписка()
	
	// НАЧАЛО Османов Н.М. 27.11.2023 ЧТЗ №2 Управление производством
	Возврат "ВЫБРАТЬ
	|	ВТ_Таблица.Ссылка КАК ЗаказНаПроизводство,
	|	ВТ_Таблица.ДокументОснование КАК ДокументОснование,
	|	ЗаказНаПроизводство2_2Продукция.Номенклатура КАК Номенклатура,
	|	ЗаказНаПроизводство2_2Продукция.Характеристика КАК Характеристика,
	|	ЗаказНаПроизводство2_2Продукция.Спецификация КАК Спецификация,
	|	ЗаказНаПроизводство2_2Продукция.Спецификация.КонецДействия КАК ДатаЗавершения,
	|	ЗаказНаПроизводство2_2Продукция.Упаковка,
	|	ЗаказНаПроизводство2_2Продукция.КоличествоУпаковок
	|ПОМЕСТИТЬ ВТ_Продукция
	|ИЗ
	|	Документ.ЗаказНаПроизводство2_2 КАК ВТ_Таблица
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаПроизводство2_2.Продукция КАК ЗаказНаПроизводство2_2Продукция
	|		ПО ВТ_Таблица.Ссылка = ЗаказНаПроизводство2_2Продукция.Ссылка
	|         И (ЗаказНаПроизводство2_2Продукция.НомерСтроки = 1)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Таблица.Ссылка,
	|	ВТ_Таблица.ДокументОснование,
	|	ЗаказНаПроизводство2_2Продукция.Номенклатура,
	|	ЗаказНаПроизводство2_2Продукция.Характеристика,
	|	ЗаказНаПроизводство2_2Продукция.Спецификация,
	|	ЗаказНаПроизводство2_2Продукция.Спецификация.КонецДействия,
	|	ЗаказНаПроизводство2_2Продукция.Упаковка,
	|	ЗаказНаПроизводство2_2Продукция.КоличествоУпаковок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Таблица.Ссылка КАК Ссылка,
	|	Таблица.Номер КАК Номер,
	|	Таблица.Дата КАК Дата,
	|	Таблица.Статус КАК Статус,
	|	Таблица.Приоритет КАК Приоритет,
	|	Таблица.Подразделение КАК Подразделение,
	|	Таблица.НачатьНеРанее КАК НачалоПроизводства,
	|	Таблица.ДатаПотребности КАК ДатаПотребности,
	|	НАЧАЛОПЕРИОДА(Таблица.ДатаПотребности, ДЕНЬ) КАК ДатаСобытия,
	|	ВЫБОР
	|		КОГДА Таблица.ДатаПотребности <> ДАТАВРЕМЯ(1, 1, 1)
	|				И &ДатаАктуальности > Таблица.ДатаПотребности
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Просрочен,
	|	Таблица.ДинамическаяСтруктура КАК ДинамическаяСтруктура,
	|	ВЫБОР
	|		КОГДА Таблица.ДинамическаяСтруктура
	|					И (ИСТИНА В
	|							(ВЫБРАТЬ ПЕРВЫЕ 1
	|								ИСТИНА
	|							ИЗ
	|								РегистрСведений.ЗаданияКРасчетуСтруктурыЗаказаСпецификации КАК Т
	|							ГДЕ
	|								Т.ЗаказНаПроизводство = Таблица.Ссылка)
	|						ИЛИ ИСТИНА В
	|							(ВЫБРАТЬ ПЕРВЫЕ 1
	|								ИСТИНА
	|							ИЗ
	|								РегистрСведений.БуферЗаданийКРасчетуСтруктурыЗаказаСпецификации КАК Т
	|							ГДЕ
	|								Т.ЗаказНаПроизводство = Таблица.Ссылка)
	|						ИЛИ ИСТИНА В
	|							(ВЫБРАТЬ ПЕРВЫЕ 1
	|								ИСТИНА
	|							ИЗ
	|								РегистрСведений.ЗаданияКРасчетуСтруктурыЗаказаРаспределениеЗапасов КАК Т
	|							ГДЕ
	|								Т.ЗаказНаПроизводство = Таблица.Ссылка)
	|						ИЛИ ИСТИНА В
	|							(ВЫБРАТЬ ПЕРВЫЕ 1
	|								ИСТИНА
	|							ИЗ
	|								РегистрСведений.БуферЗаданийКРасчетуСтруктурыЗаказаРаспределениеЗапасов КАК Т
	|							ГДЕ
	|								Т.ЗаказНаПроизводство = Таблица.Ссылка))
	|				ИЛИ ИСТИНА В
	|					(ВЫБРАТЬ ПЕРВЫЕ 1
	|						ИСТИНА
	|					ИЗ
	|						РегистрСведений.ЗаданияКОчисткеСтруктурыЗаказа КАК Т
	|					ГДЕ
	|						Т.ЗаказНаПроизводство = Таблица.Ссылка)
	|			ТОГДА 5
	|		КОГДА Таблица.ДинамическаяСтруктура
	|				И ИСТИНА В
	|					(ВЫБРАТЬ ПЕРВЫЕ 1
	|						ИСТИНА
	|					ИЗ
	|						РегистрСведений.ПротоколРасчетаСтруктурыЗаказа КАК Т
	|					ГДЕ
	|						Т.ЗаказНаПроизводство = Таблица.Ссылка)
	|				И Таблица.Проведен
	|			ТОГДА 6
	|		КОГДА НЕ Таблица.ДинамическаяСтруктура
	|				И СостоянияЗаказовНаПроизводство.СостояниеЭтапов = &СостояниеТребуетсяПроверитьЭтапы
	|			ТОГДА 2
	|		КОГДА НЕ Таблица.ДинамическаяСтруктура
	|				И СостоянияЗаказовНаПроизводство.СостояниеЭтапов = &СостояниеТребуетсяСформироватьЭтапы
	|			ТОГДА 1
	|		КОГДА &ПланируетсяГрафикПроизводства
	|				И ИСТИНА В
	|					(ВЫБРАТЬ ПЕРВЫЕ 1
	|						ИСТИНА
	|					ИЗ
	|						РегистрСведений.ЗаданияКРасчетуГрафикаПроизводства КАК Т
	|					ГДЕ
	|						Т.Распоряжение = Таблица.Ссылка)
	|			ТОГДА 3
	|		КОГДА СостоянияЗаказовНаПроизводство.СостояниеЭтапов = &СостояниеТребуетсяПередатьЭтапыКВыполнению
	|			ТОГДА 4
	|		ИНАЧЕ -1
	|	КОНЕЦ КАК СостояниеЭтаповИГрафикаПроизводства,
	|	ВЫБОР
	|		КОГДА СостоянияЗаказовНаПроизводство.СостояниеОбеспечения = &СостояниеТребуетсяОбеспечение
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СостояниеОбеспечения,
	|	ВЫБОР
	|		КОГДА СостоянияЗаказовНаПроизводство.СостояниеВыпуска = &СостояниеВыполнен
	|			ТОГДА 2
	|		КОГДА СостоянияЗаказовНаПроизводство.СостояниеВыпуска = &СостояниеНарушенаДатаПотребности
	|			ТОГДА 1
	|		ИНАЧЕ -1
	|	КОНЕЦ КАК СостояниеВыпускаПродукции,
	|	ВЫБОР Таблица.Статус
	|		КОГДА ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовНаПроизводство2_2.КПроизводству)
	|			ТОГДА 1
	|		КОГДА ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовНаПроизводство2_2.Формируется)
	|			ТОГДА 2
	|		КОГДА ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовНаПроизводство2_2.Закрыт)
	|			ТОГДА 3
	|		ИНАЧЕ 4
	|	КОНЕЦ КАК СтатусОчередь,
	|	-Таблица.Приоритет.РеквизитДопУпорядочивания КАК ПриоритетОчередь,
	|	Таблица.Подразделение.РеквизитДопУпорядочивания КАК ПодразделениеОчередь,
	|	Таблица.Очередь КАК Очередь,
	|	Таблица.Ответственный КАК Ответственный,
	|	Таблица.Комментарий КАК Комментарий,
	|	ВТ_Продукция.ДатаЗавершения КАК ДатаЗавершения,
	|	ВТ_Продукция.Номенклатура КАК Номенклатура,
	|	ВТ_Продукция.Характеристика КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ВТ_Продукция.ДокументОснование ССЫЛКА Документ.ЗаказКлиента ТОГДА
	|			ВЫРАЗИТЬ(ВТ_Продукция.ДокументОснование КАК Документ.ЗаказКлиента).Контрагент
	|		ИНАЧЕ ВТ_Продукция.ДокументОснование
	|	КОНЕЦ КАК Контрагент,
	|	ВТ_Продукция.ДокументОснование.Номер КАК НомерЗаказа,
	|	ВТ_Продукция.Упаковка КАК Упаковка,
	|	ВТ_Продукция.КоличествоУпаковок КАК Количество,
	|	Таблица.ГосЗаказ КАК ГосЗаказ,
	|	Таблица.СпециальныеТребования КАК СпециальныеТребования
	|ИЗ
	|	Документ.ЗаказНаПроизводство2_2 КАК Таблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияЗаказовНаПроизводство КАК СостоянияЗаказовНаПроизводство
	|		ПО Таблица.Ссылка = СостоянияЗаказовНаПроизводство.Заказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Продукция КАК ВТ_Продукция
	|		ПО (ВТ_Продукция.ЗаказНаПроизводство = Таблица.Ссылка)";
	// КОНЕЦ Османов Н.М. 27.11.2023 ЧТЗ №2 Управление производством
	
КонецФункции

&НаКлиенте
Процедура ПриИзмененииОтбораСтатуса(Элемент)
		
	СписокОтбора = Новый СписокЗначений;
	Для Каждого СписокЗначение Из ЭтотОбъект["ОтборСпискаВыбораСтатусов"] Цикл
		
		ИмяЭлемента = СтрЗаменить(СписокЗначение.Значение, " ", "");
		ПеречислениеЭлемента = ПредопределенноеЗначение("Перечисление.СтатусыЗаказовНаПроизводство2_2." + ИмяЭлемента);
		
		Если ЭтотОбъект["ОтборПоСтатусам" + ИмяЭлемента] = Истина Тогда
			СписокОтбора.Добавить(ПеречислениеЭлемента);
		КонецЕсли;
	КонецЦикла;
	
	УстановитьОтбор = Истина;
	Если СписокОтбора.Количество() = 0 Тогда
		УстановитьОтбор = Ложь;
	КонецЕсли;

	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, 
														"Статус",
														СписокОтбора,
														УстановитьОтбор,
														ВидСравненияКомпоновкиДанных.ВСписке);
КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("УстановитьСвойстваДинамическогоСписка")
Процедура П3_УстановитьСвойстваДинамическогоСписка()

	ТекстЗапроса =
		"ВЫБРАТЬ
		|	
		|	Таблица.Ссылка КАК Ссылка,
		|	Таблица.Номер КАК Номер,
		|	Таблица.Дата КАК Дата,
		|	Таблица.Статус КАК Статус,
		|	Таблица.Приоритет КАК Приоритет,
		|	Таблица.Подразделение КАК Подразделение,
		|	Таблица.НачатьНеРанее КАК НачалоПроизводства,
		|	Таблица.ДатаПотребности КАК ДатаПотребности,
		|	Таблица.ДинамическаяСтруктура КАК ДинамическаяСтруктура,
		|	
		|	&ТекстПоляДатаСобытия КАК ДатаСобытия,
		|	&ТекстПоляПросрочен КАК Просрочен,
		|	
		|	ВЫБОР
		|		
		|		КОГДА Таблица.ДинамическаяСтруктура
		|			И (ИСТИНА В 
		|				(ВЫБРАТЬ ПЕРВЫЕ 1
		|					ИСТИНА
		|				ИЗ
		|					РегистрСведений.ЗаданияКРасчетуСтруктурыЗаказаСпецификации КАК Т
		|				ГДЕ
		|					Т.ЗаказНаПроизводство = Таблица.Ссылка)
		|				ИЛИ ИСТИНА В
		|				(ВЫБРАТЬ ПЕРВЫЕ 1
		|					ИСТИНА
		|				ИЗ
		|					РегистрСведений.БуферЗаданийКРасчетуСтруктурыЗаказаСпецификации КАК Т
		|				ГДЕ
		|					Т.ЗаказНаПроизводство = Таблица.Ссылка)
		|				ИЛИ ИСТИНА В
		|				(ВЫБРАТЬ ПЕРВЫЕ 1
		|					ИСТИНА
		|				ИЗ
		|					РегистрСведений.ЗаданияКРасчетуСтруктурыЗаказаРаспределениеЗапасов КАК Т
		|				ГДЕ
		|					Т.ЗаказНаПроизводство = Таблица.Ссылка)
		|				ИЛИ ИСТИНА В
		|				(ВЫБРАТЬ ПЕРВЫЕ 1
		|					ИСТИНА
		|				ИЗ
		|					РегистрСведений.БуферЗаданийКРасчетуСтруктурыЗаказаРаспределениеЗапасов КАК Т
		|				ГДЕ
		|					Т.ЗаказНаПроизводство = Таблица.Ссылка))
		|				ИЛИ ИСТИНА В
		|				(ВЫБРАТЬ ПЕРВЫЕ 1
		|					ИСТИНА
		|				ИЗ
		|					РегистрСведений.ЗаданияКОчисткеСтруктурыЗаказа КАК Т
		|				ГДЕ
		|					Т.ЗаказНаПроизводство = Таблица.Ссылка)
		|			ТОГДА 5
		|		
		|		КОГДА Таблица.ДинамическаяСтруктура
		|			И (ИСТИНА В
		|				(ВЫБРАТЬ ПЕРВЫЕ 1
		|					ИСТИНА
		|				ИЗ
		|					РегистрСведений.ПротоколРасчетаСтруктурыЗаказа КАК Т
		|				ГДЕ
		|					Т.ЗаказНаПроизводство = Таблица.Ссылка))
		|			И Таблица.Проведен
		|			ТОГДА 6
		|		
		|		КОГДА НЕ Таблица.ДинамическаяСтруктура
		|			И СостоянияЗаказовНаПроизводство.СостояниеЭтапов = &СостояниеТребуетсяПроверитьЭтапы
		|			ТОГДА 2
		|		
		|		КОГДА НЕ Таблица.ДинамическаяСтруктура
		|			И СостоянияЗаказовНаПроизводство.СостояниеЭтапов = &СостояниеТребуетсяСформироватьЭтапы
		|			ТОГДА 1
		|		
		|		КОГДА &ПланируетсяГрафикПроизводства
		|			И (
		|				ИСТИНА В
		|					(ВЫБРАТЬ ПЕРВЫЕ 1
		|						ИСТИНА
		|					ИЗ
		|						РегистрСведений.ЗаданияКРасчетуГрафикаПроизводства КАК Т
		|					ГДЕ
		|						Т.Распоряжение = Таблица.Ссылка)
		|				ИЛИ ИСТИНА В
		|					(ВЫБРАТЬ ПЕРВЫЕ 1
		|						ИСТИНА
		|					ИЗ
		|						РегистрСведений.ЗаданияКРасчетуСтруктурыЗаказаГрафикПроизводства КАК Т
		|					ГДЕ
		|						Т.ЗаказНаПроизводство = Таблица.Ссылка)
		|				)
		|			ТОГДА 3
		|		
		|		КОГДА СостоянияЗаказовНаПроизводство.СостояниеЭтапов = &СостояниеТребуетсяПередатьЭтапыКВыполнению
		|			ТОГДА 4
		|		
		|		ИНАЧЕ -1
		|		
		|	КОНЕЦ КАК СостояниеЭтаповИГрафикаПроизводства,
		|
		|	ВЫБОР
		|		КОГДА СостоянияЗаказовНаПроизводство.СостояниеОбеспечения = &СостояниеТребуетсяОбеспечение
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК СостояниеОбеспечения,
		|
		|	ВЫБОР
		|		КОГДА СостоянияЗаказовНаПроизводство.СостояниеВыпуска = &СостояниеВыполнен
		|			ТОГДА 2
		|		КОГДА СостоянияЗаказовНаПроизводство.СостояниеВыпуска = &СостояниеНарушенаДатаПотребности
		|			ТОГДА 1
		|		ИНАЧЕ -1
		|	КОНЕЦ КАК СостояниеВыпускаПродукции,
		|	
		|	-Таблица.Приоритет.РеквизитДопУпорядочивания КАК ПриоритетОчередь,
		|	Таблица.Подразделение.РеквизитДопУпорядочивания КАК ПодразделениеОчередь,
		|	Таблица.Очередь КАК Очередь,
		|
		|	Таблица.Ответственный КАК Ответственный,
		|	Таблица.Комментарий   КАК Комментарий
		|
		|ИЗ
		|	Документ.ЗаказНаПроизводство2_2 КАК Таблица
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияЗаказовНаПроизводство КАК СостоянияЗаказовНаПроизводство
		|		ПО Таблица.Ссылка = СостоянияЗаказовНаПроизводство.Заказ
		|		 
		|ГДЕ 
		|	Таблица.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовНаПроизводство2_2.КПроизводству)
		|	И Таблица.Проведен";
	
	Если Не ИспользуетсяДинамическаяСтруктура Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстПоляДатаСобытия", "Таблица.ДатаПотребности");
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, 
			"&ТекстПоляДатаСобытия", 
			"ВЫБОР
			|	КОГДА СостоянияЗаказовНаПроизводство.СостояниеВыпуска = &СостояниеВыполнен ТОГДА
			|		ДАТАВРЕМЯ(1, 1, 1)
			|	ИНАЧЕ
			// заглушка на период обновления данных в ИБ
			|		ВЫБОР
			|			КОГДА ISNULL(СостоянияЗаказовНаПроизводство.ДатаСобытия, ДАТАВРЕМЯ(1,1,1)) = ДАТАВРЕМЯ(1,1,1) ТОГДА 
			|				Таблица.ДатаПотребности
			|			ИНАЧЕ
			|				СостоянияЗаказовНаПроизводство.ДатаСобытия
			|		КОНЕЦ
			|КОНЕЦ");
	КонецЕсли; 
		
	Если Не ИспользуетсяДинамическаяСтруктура Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, 
			"&ТекстПоляПросрочен", 
			"ВЫБОР 
			|	КОГДА Таблица.ДатаПотребности <> ДАТАВРЕМЯ(1, 1, 1)
			|		И &ДатаАктуальности > Таблица.ДатаПотребности
			|	ТОГДА ИСТИНА
			|	ИНАЧЕ ЛОЖЬ
			|КОНЕЦ");
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, 
			"&ТекстПоляПросрочен", 
			"ВЫБОР
			|	КОГДА НЕ ISNULL(СостоянияЗаказовНаПроизводство.ДатаСобытия, ДАТАВРЕМЯ(1,1,1)) = ДАТАВРЕМЯ(1,1,1) 
			|		И &ДатаАктуальности > СостоянияЗаказовНаПроизводство.ДатаСобытия
			|	ТОГДА ИСТИНА
			|	ИНАЧЕ ЛОЖЬ
			|КОНЕЦ");
	КонецЕсли;
		
	СвойстваСписка = ОбщегоНазначения.СтруктураСвойствДинамическогоСписка();

	СвойстваСписка.ТекстЗапроса = ТекстЗапроса;
	#Вставка
	СвойстваСписка.ТекстЗапроса = ТекстЗапросаДинамическогоСписка();
	#КонецВставки
	СвойстваСписка.ОсновнаяТаблица = Список.ОсновнаяТаблица;
	СвойстваСписка.ДинамическоеСчитываниеДанных = Истина;

	ОбщегоНазначения.УстановитьСвойстваДинамическогоСписка(Элементы.Список, СвойстваСписка);
	
	Список.Параметры.УстановитьЗначениеПараметра("ДатаАктуальности", НачалоДня(ТекущаяДатаСеанса()));
	Список.Параметры.УстановитьЗначениеПараметра("ПланируетсяГрафикПроизводства", ПланируетсяГрафикПроизводства);
	Список.Параметры.УстановитьЗначениеПараметра("СостояниеТребуетсяПроверитьЭтапы", Перечисления.СостоянияЗаказовНаПроизводствоВОчереди.ТребуетсяПроверитьЭтапы);
	Список.Параметры.УстановитьЗначениеПараметра("СостояниеТребуетсяСформироватьЭтапы", Перечисления.СостоянияЗаказовНаПроизводствоВОчереди.ТребуетсяСформироватьЭтапы);
	Список.Параметры.УстановитьЗначениеПараметра("СостояниеТребуетсяПередатьЭтапыКВыполнению", Перечисления.СостоянияЗаказовНаПроизводствоВОчереди.ТребуетсяПередатьЭтапыКВыполнению);
	Список.Параметры.УстановитьЗначениеПараметра("СостояниеТребуетсяОбеспечение", Перечисления.СостоянияЗаказовНаПроизводствоВОчереди.ТребуетсяОбеспечение);
	Список.Параметры.УстановитьЗначениеПараметра("СостояниеНарушенаДатаПотребности", Перечисления.СостоянияЗаказовНаПроизводствоВОчереди.НарушенаДатаПотребности);
	Список.Параметры.УстановитьЗначениеПараметра("СостояниеВыполнен", Перечисления.СостоянияЗаказовНаПроизводствоВОчереди.Выполнен);

КонецПроцедуры

#КонецОбласти
